In [153]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [154]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

In [155]:
internet_df = pd.read_csv('../data/internet_use.csv', nrows=4495)
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

In [156]:
gdp_df.shape

(6731, 4)

In [158]:
internet_df.shape

(4495, 4)

In [159]:
type(gdp_df.columns)

pandas.core.indexes.base.Index

In [160]:
type(internet_df.columns)

pandas.core.indexes.base.Index

In [161]:
gdp_df.tail(n=10)

,Country or Area,Year,Value,Value Footnotes
6721,Zimbabwe,1997,3036.422224,NaN
6722,Zimbabwe,1996,2985.856605,NaN
6723,Zimbabwe,1995,2736.486436,NaN
6724,Zimbabwe,1994,2768.309953,NaN
6725,Zimbabwe,1993,2572.870395,NaN
6726,Zimbabwe,1992,2591.007534,NaN
6727,Zimbabwe,1991,2906.272849,NaN
6728,Zimbabwe,1990,2819.549467,NaN
6729,footnoteSeqID,Footnote,NaN,NaN
6730,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [162]:
internet_df.tail(n=10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [163]:

gdp_df.drop(columns = ['Value Footnotes'], axis=1, inplace=True)

In [164]:
internet_df.drop(columns = ['Value Footnotes'],axis=1, inplace=True)

In [165]:
gdp_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [166]:
internet_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [151]:
gdp_df.columns = (['Country', 'Year', 'GDP_Per_Capita'])
gdp_df.head(2)

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     1734.723214
1  Afghanistan  2017     1758.465636

In [ ]:
‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [152]:
internet_df.columns = (['Country', 'Year', 'Internet_Users_Pct'])
internet_df.head(2)

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014                6.39
1  Afghanistan  2013                5.90

In [133]:
 internet_df = internet_df[['Country', 'Year', 'Internet_Users_Pct']]
gdp_df = (['Country', 'Year', 'GDP_Per_Capita'])
print(internet_df.head(2))
print(gdp_df.head(2))

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014                6.39
1  Afghanistan  2013                5.90

AttributeError: 'list' object has no attribute 'head'

In [ ]:
gdp_and_internet_use =

In [ ]:
schools_with_scores = pd.merge(schools_subset, indicators_subset, left_on = 'name', right_on = 'school_name', how = 'inner')
schools_with_scores.head(3)